from random import choice
from modules.base_module import BaseModule


class ChoseFood(BaseModule):
    def run(self, update, context):
        diction = {'drink': {'чай': [' черный, ', " зеленый, ", " белый, ", " красный, ", " фруктовый, "],
                             "сок": [" яблочный,", " апельсиновый, ", " персиковый, ", " грушевый, ", " виноградный," ],
                             "смузи": [" с бананом, ", " с клубникой, ", " с персиком, ", " с малиной, "]},
                   'first': {"суп": [" харчо, ", " рассольник, ", " щи, ", " борщ, ", " уха, "]},
                   'second': {"картофельное пюре": [" с отварной курицей, ", " с говяжей котлетой, ", " с куриной котлейтой, ", " с рыбой, ", " со свиной котлетой, "],
                              "гречка": [" с отварной курицей, ", " с говяжей котлетой, ", " с куриной котлейтой, ", " с рыбой, ", " со свиной котлетой, "],
                              "рис": [" с отварной курицей, ", " с говяжей котлетой, ", " с куриной котлейтой, ", " с рыбой, ", " со свиной котлетой, "],
                              "макароны": [" с отварной курицей, ", " с говяжей котлетой, ", " с куриной котлейтой, ", " с рыбой, ", " со свиной котлетой, "]},
                   'salad': {'салад': [" цезарь", " сельд под шубой", " квашеная капуста", " витаминный"]}}
        result = ''
        for key, value in diction.items():
            a = choice(list(value.keys()))
            result += a
            b = choice((value[a]))
            result += b
        result += '. Приятного аппетита!'
        self.send(update, context, text=result)


chose_food_module = ChoseFood()